ETL process of excel file

In [28]:
import pandas as pd

In [29]:
file = pd.read_excel(r'/Users/madhubabuduggirala/Downloads/Rawdata.xlsx')

In [30]:
id(file)

4986526800

In [45]:
working_file = file.copy()

In [46]:
working_file.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [47]:
working_file

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [48]:
working_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [49]:
working_file.head()# to check the columns needed from the top end

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [50]:
working_file.tail(1)#reterive records from the end of the sheet

  Name Domain   Age Location   Salary  Exp
5  Kim    NLP  55yr    Delhi  6000^$0  10+

In [51]:
working_file.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [52]:
working_file['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [54]:
working_file['Name'] = working_file['Name'].str.replace(r'\W', '', regex= True)
working_file['Domain'] = working_file['Domain'].str.replace(r'\W', '', regex= True)
working_file['Location'] = working_file['Location'].str.replace(r'\W', '', regex= True)
working_file['Salary'] = working_file['Salary'].str.replace(r'\W', '', regex= True)

#to remove the characters other than variables using regex

In [55]:
working_file

    Name       Domain       Age   Location Salary      Exp
0   Mike  Datascience  34 years     Mumbai   5000       2+
1  Teddy      Testing    45' yr  Bangalore  10000       <3
2   Umar  Dataanalyst       NaN        NaN  15000   4> yrs
3   Jane    Analytics       NaN   Hyderbad  20000      NaN
4  Uttam   Statistics     67-yr        NaN  30000  5+ year
5    Kim          NLP      55yr      Delhi  60000      10+

In [56]:
working_file['Age'] = working_file['Age'].str.extract('(\d+)')
working_file['Exp'] = working_file['Exp'].str.extract('(\d+)')

In [57]:
working_file

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [58]:
# here comes the cleaned data but has some NaN values to change them we have to take help  of median, mode, avg functions from pandas

In [59]:
import numpy as np

In [61]:
working_file['Age'] = working_file['Age'].fillna(np.mean(pd.to_numeric(working_file['Age'])))
working_file['Exp'] = working_file['Exp'].fillna(np.mean(pd.to_numeric(working_file['Exp'])))

In [62]:
working_file

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25        NaN  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  4.8
4  Uttam   Statistics     67        NaN  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [68]:
working_file['Location'] = working_file['Location'].fillna(working_file['Location'].mode()[0])

In [69]:
working_file

    Name       Domain    Age   Location Salary  Exp
0   Mike  Datascience     34     Mumbai   5000    2
1  Teddy      Testing     45  Bangalore  10000    3
2   Umar  Dataanalyst  50.25  Bangalore  15000    4
3   Jane    Analytics  50.25   Hyderbad  20000  4.8
4  Uttam   Statistics     67  Bangalore  30000    5
5    Kim          NLP     55      Delhi  60000   10

In [70]:
working_file.info() # as each column data type is mentioned as object we have to chnage it

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      object
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [73]:
working_file['Age'] =working_file['Age'].astype('int')
working_file['Exp'] =working_file['Exp'].astype('int')
working_file['Salary'] =working_file['Salary'].astype('int')

In [74]:
working_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int64
 3   Location  6 non-null      object
 4   Salary    6 non-null      int64
 5   Exp       6 non-null      int64
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [75]:
working_file["Name"] = working_file['Name'].astype('category')
working_file["Domain"] = working_file['Domain'].astype('category')
working_file["Location"] = working_file['Location'].astype('category')

In [76]:
working_file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int64
 3   Location  6 non-null      category
 4   Salary    6 non-null      int64
 5   Exp       6 non-null      int64
dtypes: category(3), int64(3)
memory usage: 938.0 bytes

In [79]:
working_file.to_csv('cleaned_file.csv')

In [1]:
import os
os.getcwd()

'/Users/madhubabuduggirala/Desktop/VS_code/Data_cleaning/excel_file_cleaning'